# Доверителни интервали
# Lab 7
# Г - интервал на доверие - 0.9..0.99

# Търсим P(EX да принадлежи на интервала 0.9 .. 0.99) >= r

# Задача 1
# X е нормално разпределена с EX = 13, DX = 9
# Сумата от Xi за i = 1..n е също нормално разпределена с EX1=n*EX, DX1 = n*DX
# Сума Xi / n е нормално разпределена с EX2=EX, DX2 = DX/n
# XЧ = ((Сума Xi / n) - EX) / sqrt(DX2) е стандартно нормално разпределено
# Доверителен интервал 95%, търсим доверителен интервал с най-малка дължина
# 0,95 = P(q1 < t < q2), q1 и q2 са квантили на нормалното разпределение
# тук q1 и q2 са по 2.5%
# P(EX да принадлежи на (XЧ + q1*sqrt(DX/n), XЧ + q2*sqrt(DX/n))) = 0.95

# 10.0 13.6 13.2 11.6 12.5 14.2 14.9 14.5 13.4 8.6 11.5 16.0 14.2 16.8 17.9 17.0
x <- scan()
q1 <- qnorm(0.025, 0, 1)
q2 <- qnorm(0.975, 0, 1)
m = mean(x)

lower_bound <- m + q1 * 3 / 4
upper_bound <- m + q2 * 3 / 4

# Твърдим, че с 95% доверителен интервал средното време на живот е между
# lower_bound и upper_bound

# За 98% ще стане по-широк интервал
q1 <- qnorm(0.01)
q2 <- qnorm(0.99)

lower_bound <- m + q1 * 3 / 4
upper_bound <- m + q2 * 3 / 4

# Задача 2
# Когато не знаем дисперсията - t.test(x), използваме оценката за дисперсията
# Това е разпределение на Student

# с неизвестна дисперсия и 90% интервал
res <- t.test(x, conf.level = 0.9)
res <- t.test(x, conf.level = 0.95)

# да вземем интервала само
res$conf.int

# Ако не е нормално разпределение, се използва wilcox.test(), тест за медианата
wilcox.test(x, conf.int = T, conf.level = 0.9)

# Задача 3
# X е нормално разпределена с EX = 5, DX = 4

gen_samples <- function(n = 20, int = 0.95) {
  intervals <- c()
  
  for (i in 1:100) {
    x <- rnorm(n=n, mean = 5, sd = 2)
    res <- t.test(x, conf.level=int)
    conf_int <- c(res$conf.int)
    intervals <- append(intervals, conf_int)
  }
  
  return(intervals)
}

x <- gen_samples()
r <- matrix(x, nrow=2, ncol=100)
y <- rbind(1:100, 1:100)

# графика
matplot(r, y, type='l', lty = 1)
abline(v=5)

# Извод - в 95% от случаите доверителния интервал уцелва средната стойност
# Тоест математическото очакване се намира в интервала

# Задача 5
# 87 oт 150 отговарят, че използват продукт, 92% доверителен интервал за броя
# на хората, използвали продукта
# пропорции, тук се използва prop.test
prop.test(87, 150, conf.level = 0.92)

# Извод - в този доверителен интервал хората използват продукта

# Задача 6
library(UsingR)

# rat са нормални разпределени
# qqnorm(rat)
# qqline(rat)

t.test(rat, conf.level = 0.96)

# exec.pay не са нормално разпределени
wilcox.test(exec.pay, conf.int = T, conf.level = 0.96)

# malpract не са нормално разпределени
wilcox.test(malpract, conf.int = T, conf.level = 0.96)
